SunCity/src/Documents/НанесениеКодовМаркировкиСУЗИСМПТК/НанесениеКодовМаркировкиСУЗИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НанесениеКодовМаркировкиСУЗИСМПТК</name>
  <comment>Отчет об использовании кодов маркировки</comment>
  <posting>Deny</posting>
  <attributes>
    <name>OrderID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработкиОтчетовСУЗИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДокументовСУЗИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеНанесениеКодовМаркировкиСУЗИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИспользования</name>
    <type>
      <types>EnumRef.ТипыИспользованияСУЗИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПроизводственнойСерии</name>
    <comment>seriesNumber</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИСМПТК</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойЛинии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.НоменклатураИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатурыИСМПТК</types>
      </type>
    </attributes>
    <attributes>
      <name>GTIN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодМаркировки</name>
      <comment>Код товара в ИС МПТ</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодИдентификации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/Enums/СтатусыОбработкиОтчетовСУЗИСМПТК/СтатусыОбработкиОтчетовСУЗИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбработкиОтчетовСУЗИСМПТК</name>
  <enumValues>
    <name>ВОжидании</name>
    <comment>PENDING</comment>
  </enumValues>
  <enumValues>
    <name>ГотовКОтправке</name>
    <comment>READY_TO_SEND</comment>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
    <comment>REJECTED</comment>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
    <comment>SENT</comment>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Documents/НанесениеКодовМаркировкиСУЗИСМПТК/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Представление = НСтр("ru='Нанесение кодов маркировки (СУЗ) №%1 от %2'");
	Представление = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(Представление, Данные.Номер, Формат(Данные.Дата, "ДЛФ=DT")); 
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

// Удаляет использованные коды маркировки из пула в случаях:
//   * Все коды маркировки по основанию распечатаны, основание полностью оформлено (по основанию)
//   * Основание не указано или архивировано, коды маркировки распечатаны (по использованным кодам).
//
Процедура ПолучитьИнформациюПоСтатусамНанесения() Экспорт
	
	НастройкаОбменаСУЗ = ИнтеграцияИСМПТК.НастройкиОбменаСУЗ();
	Если Не НастройкаОбменаСУЗ = Неопределено Тогда
		Если ТипЗнч(НастройкаОбменаСУЗ) = Тип("Массив") Тогда
			Для Каждого Настройка Из НастройкаОбменаСУЗ Цикл
				ПолучитьИнформациюПоСтатусамНанесенияПродолжить(Настройка);
			КонецЦикла;
		Иначе
			ПолучитьИнформациюПоСтатусамНанесенияПродолжить(НастройкаОбменаСУЗ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьИнформациюПоСтатусамНанесенияПродолжить(НастройкаОбменаСУЗ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НанесениеКодовМаркировкиСУЗИСМПТК.OrderID КАК OrderID,
	|	НанесениеКодовМаркировкиСУЗИСМПТК.Статус КАК Статус,
	|	НанесениеКодовМаркировкиСУЗИСМПТК.Ссылка КАК Ссылка,
	|	НанесениеКодовМаркировкиСУЗИСМПТК.ВидПродукции КАК ВидПродукции
	|ИЗ
	|	Документ.НанесениеКодовМаркировкиСУЗИСМПТК КАК НанесениеКодовМаркировкиСУЗИСМПТК
	|ГДЕ
	|	НЕ НанесениеКодовМаркировкиСУЗИСМПТК.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиОтчетовСУЗИСМПТК.Отклонен)
	|	И НЕ НанесениеКодовМаркировкиСУЗИСМПТК.OrderID = &ПустаяСтрока";
	
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Результат = Запрос.Выполнить();
	ОтветСервера = Неопределено;
	
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл 
			
			ОтветСервера = ИнтеграцияИСМПТК.ПолучитьСтатусНанесенияКМ(НастройкаОбменаСУЗ, Выборка.ВидПродукции, Выборка.OrderID);
			
			Если Не ЗначениеЗаполнено(ОтветСервера.ТекстОшибки) Тогда
				
				СтатусОтчета = ИнтеграцияИСМПТК.СтатусОбработкиОтчета(ОтветСервера.ДанныеОСтатусах["reportStatus"]);
				Если Не Выборка.Статус = СтатусОтчета Тогда 
					ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
					ДокументОбъект.Статус = СтатусОтчета;
					
					Попытка
						ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
					Исключение
						ТекстСообщения = РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияОшибкаПриЗаписиСтатусНеИзменилсяСПараметрами();
						ТекстСообщения = ОбщегоНазначенияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения, ДокументОбъект, СтатусОтчета);
						
						ИмяСобытия  = РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияОшибкаВФункцииСПараметром();
						ИмяСобытия  = СтрЗаменить(ИмяСобытия, "%ИмяФункции%", "Документы.НанесениеКодовМаркировкиСУЗИСМПТК.ПолучитьИнформациюПоСтатусамНанесенияПродолжить");
						ТекстОшибки = НСтр("ru = 'Ошибка при выполнении регламентного задания ""%ИмяЗадания%"":'")
									+ Символы.ПС
									+ ТекстСообщения;
						ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИмяЗадания%", Метаданные.РегламентныеЗадания.ОтправкаПолучениеДанныхСУЗИСМПТК.Предопределенное);
						ОбщегоНазначенияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки, ИмяСобытия);
					КонецПопытки;
				КонецЕсли;
			Иначе
				ОбщегоНазначенияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ОтветСервера.ТекстОшибки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ОтветСервера = Неопределено Тогда
		Если ЗначениеЗаполнено(ОтветСервера.ТекстОшибки) Тогда
			ИмяСобытия  = РаботаСТекстамиИСМПТККлиентСервер.ТекстСообщенияОшибкаВФункцииСПараметром();
			ИмяСобытия  = СтрЗаменить(ИмяСобытия, "%ИмяФункции%", "Документы.НанесениеКодовМаркировкиСУЗИСМПТК.ПолучитьИнформациюПоСтатусамНанесенияПродолжить");
			ТекстОшибки = НСтр("ru = 'Ошибка при выполнении регламентного задания ""%ИмяЗадания%"":'")
						+ Символы.ПС
						+ ОтветСервера.ТекстОшибки;
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИмяЗадания%", Метаданные.РегламентныеЗадания.ОтправкаПолучениеДанныхСУЗИСМПТК.Предопределенное);
			ОбщегоНазначенияИСМПТКВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки, ИмяСобытия);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	РаботаСДокументамиИСМПТКПереопределяемый.ПриЗаполненииОграниченияДоступа(Ограничение, ОбщегоНазначенияИСМПТКВызовСервера.ИмяДокументаНанесениеКодовМаркировкиСУЗИСМПТК());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
